Австралия/src/Documents/ProductionTask/ProductionTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionTask</name>
  <basedOn>Document.ManufacturingOperation</basedOn>
  <registerRecords>AccumulationRegister.ProductionAccomplishment</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.ManufacturingOperation</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProductionTaskStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.ManufacturingActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>ConnectionKey</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationQuantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Output</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardTimeInUOM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TimeUOM</name>
    <type>
      <types>CatalogRef.TimeUOM</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StartDatePlanned</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EndDatePlanned</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkcenterType</name>
    <type>
      <types>CatalogRef.CompanyResourceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Workcenter</name>
    <type>
      <types>CatalogRef.CompanyResources</types>
    </type>
  </attributes>
  <attributes>
    <name>Assignee</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ComponentsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ParentTask</name>
    <type>
      <types>DocumentRef.ProductionTask</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Enums/ProductionTaskStatuses/ProductionTaskStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionTaskStatuses</name>
  <enumValues>
    <name>Open</name>
  </enumValues>
  <enumValues>
    <name>Suspended</name>
  </enumValues>
  <enumValues>
    <name>InProgress</name>
  </enumValues>
  <enumValues>
    <name>Completed</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Split</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/ProductionOrder/ProductionOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionOrder</name>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.SubcontractorOrderReceived</basedOn>
  <registerRecords>AccumulationRegister.ManufacturingProcessSupply</registerRecords>
  <registerRecords>AccumulationRegister.ProductionOrders</registerRecords>
  <registerRecords>AccumulationRegister.ProductionComponents</registerRecords>
  <registerRecords>AccumulationRegister.InventoryDemand</registerRecords>
  <registerRecords>AccumulationRegister.ReservedProducts</registerRecords>
  <registerRecords>AccumulationRegister.ProductRelease</registerRecords>
  <registerRecords>AccumulationRegister.Backorders</registerRecords>
  <registerRecords>AccumulationRegister.InventoryFlowCalendar</registerRecords>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnitReserve</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderState</name>
    <type>
      <types>CatalogRef.ProductionOrderStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Priority</name>
    <type>
      <types>CatalogRef.ProductionOrdersPriorities</types>
    </type>
  </attributes>
  <attributes>
    <name>UseProductionPlanning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrderPosition</name>
    <type>
      <types>EnumRef.AttributeStationing</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductsType</name>
      <type>
        <types>EnumRef.ProductsTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/ProductionTask/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure InitializeDocumentData(DocumentRef, AdditionalProperties) Export
	
	Query = New Query;
	Query.TempTablesManager = AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	
	#Region InitializeDocumentDataQueryText
	
	Query.Text = 
	"SELECT
	|	ProductionTaskDocument.Date AS Period,
	|	ProductionTaskDocument.BasisDocument AS WorkInProgress,
	|	VALUE(AccumulationRecordType.Receipt) AS RecordType,
	|	ProductionTaskDocument.Operation AS Operation,
	|	CASE
	|		WHEN ProductionTaskDocument.Status = VALUE(Enum.ProductionTaskStatuses.Canceled)
	|			THEN 0
	|		ELSE ProductionTaskDocument.OperationQuantity
	|	END AS Quantity,
	|	CASE
	|		WHEN ProductionTaskDocument.Status = VALUE(Enum.ProductionTaskStatuses.Completed)
	|			THEN ProductionTaskDocument.OperationQuantity
	|		ELSE 0
	|	END AS QuantityProduced,
	|	ProductionTaskDocument.ConnectionKey AS ConnectionKey
	|FROM
	|	Document.ProductionTask AS ProductionTaskDocument
	|WHERE
	|	ProductionTaskDocument.Ref = &Ref";
	
	#EndRegion
	
	Query.SetParameter("Ref", DocumentRef);
	
	ResultsArray = Query.ExecuteBatch();
	
	AdditionalProperties.TableForRegisterRecords.Insert("TableProductionAccomplishment", ResultsArray[0].Unload());
	
EndProcedure

#Region LibrariesHandlers

#Region ObjectVersioning

// StandardSubsystems.ObjectVersioning

Procedure OnDefineObjectVersioningSettings(Settings) Export

EndProcedure

// End StandardSubsystems.ObjectVersioning

#EndRegion

#Region PrintInterface

// Generate objects printing forms.
//
// Incoming:
//   TemplateNames    - String    - Names of layouts separated
//   by commas ObjectsArray  - Array    - Array of refs to objects that
//   need to be printed PrintParameters - Structure - Structure of additional printing parameters
//
// Outgoing:
//   PrintFormsCollection - Values table - Generated
//   table documents OutputParameters       - Structure        - Parameters of generated table documents
//
Procedure Print(ObjectsArray, PrintParameters, PrintFormsCollection, PrintObjects, OutputParameters) Export
	
	If PrintManagement.TemplatePrintRequired(PrintFormsCollection, "ProductionTasksList") Then
		
		PrintManagement.OutputSpreadsheetDocumentToCollection(
			PrintFormsCollection,
			"ProductionTasksList",
			Nstr("en = 'Production tasks list'; ru = 'Список производственных задач';pl = 'Lista zadań produkcyjnych';es_ES = 'Lista de tareas de producción';es_CO = 'Lista de tareas de producción';tr = 'Üretim görevleri listesi';it = 'Elenco incarichi di produzione';de = 'Liste der Produktionsaufgaben'"),
			PrintForm(
				ObjectsArray,
				PrintObjects,
				"ProductionTasksList",
				PrintParameters.Result));
			
	EndIf;
	
EndProcedure

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID							= "ProductionTasksList";
	PrintCommand.Presentation				= NStr("en = 'Production tasks list'; ru = 'Список производственных задач';pl = 'Lista zadań produkcyjnych';es_ES = 'Lista de tareas de producción';es_CO = 'Lista de tareas de producción';tr = 'Üretim görevleri listesi';it = 'Elenco incarichi di produzione';de = 'Liste der Produktionsaufgaben'");
	PrintCommand.CheckPostingBeforePrint	= True;
	PrintCommand.Order						= 1;
	
EndProcedure

#EndRegion

#EndRegion

#EndRegion

#Region Private

#Region PrintInterface

Function PrintProductionTasksList(ObjectsArray, PrintObjects, TemplateName, PrintParams)
	
	// MultilingualSupport
	
	If PrintParams = Undefined Then
		LanguageCode = CommonClientServer.DefaultLanguageCode();
	Else
		LanguageCode = PrintParams.LanguageCode;
	EndIf;
	
	If LanguageCode <> CurrentLanguage().LanguageCode Then 
		SessionParameters.LanguageCodeForOutput = LanguageCode;
	EndIf;
	
	// End MultilingualSupport
	
	SpreadsheetDocument = New SpreadsheetDocument;
	SpreadsheetDocument.PrintParametersKey = "PrintParameters_ProductionTasksList";
	SpreadsheetDocument.PrintParametersName = "PrintParameters_ProductionTasksList";
	
	Template = PrintManagement.PrintFormTemplate("Document.ProductionTask.ProductionTasksList", LanguageCode);
	
	Query = New Query();
	Query.SetParameter("ObjectsArray", ObjectsArray);
	Query.Text =
	"SELECT
	|	ProductionTask.Ref AS ProductionTask,
	|	ProductionTask.Company AS Company,
	|	ProductionTask.StructuralUnit AS StructuralUnit,
	|	ProductionOrder.BasisDocument AS SalesOrder,
	|	ManufacturingOperation.Products AS FinishedProduct,
	|	ManufacturingOperation.Characteristic AS FinishedVariant,
	|	ManufacturingOperation.Quantity AS ProductQuantity,
	|	ManufacturingOperation.MeasurementUnit AS Unit,
	|	ProductionTask.Output AS Output,
	|	ProductionOrder.Ref AS ProductionOrder,
	|	ProductionTask.Operation AS Operation,
	|	ProductionTask.OperationQuantity AS OperationQuantity,
	|	ProductionTask.StandardTimeInUOM AS StandardTimeInUOM,
	|	ProductionTask.TimeUOM AS TimeUOM,
	|	ProductionTask.EndDatePlanned AS EndDatePlanned,
	|	ProductionTask.StartDatePlanned AS StartDatePlanned,
	|	ProductionTask.WorkcenterType AS WorkcenterType,
	|	ProductionTask.Workcenter AS Workcenter,
	|	ProductionTask.Assignee AS Assignee,
	|	ProductionTask.Number AS TaskNumber,
	|	ProductionTask.Date AS TaskDate
	|FROM
	|	Document.ProductionTask AS ProductionTask
	|		LEFT JOIN Document.ManufacturingOperation AS ManufacturingOperation
	|			LEFT JOIN Document.ProductionOrder AS ProductionOrder
	|			ON ManufacturingOperation.BasisDocument = ProductionOrder.Ref
	|		ON ProductionTask.BasisDocument = ManufacturingOperation.Ref
	|WHERE
	|	ProductionTask.Ref IN(&ObjectsArray)
	|
	|ORDER BY
	|	TaskNumber
	|TOTALS
	|	MAX(Company),
	|	MAX(StructuralUnit),
	|	MAX(SalesOrder)
	|BY
	|	ProductionOrder";
	
	// MultilingualSupport
	DriveServer.ChangeQueryTextForCurrentLanguage(Query.Text, LanguageCode);
	// End MultilingualSupport
	
	ProductionOrderHeader = Query.Execute().Select(QueryResultIteration.ByGroups);
	
	// Header
	TemplateArea = Template.GetArea("Header");
	TemplateArea.Parameters.CurrentDate = Format(CurrentSessionDate(), "DLF=D");
	SpreadsheetDocument.Put(TemplateArea);
	
	EmptyLine = Template.GetArea("EmptyLine");
	SpreadsheetDocument.Put(EmptyLine);
	
	While ProductionOrderHeader.Next() Do
		
		// Production order header
		
		TemplateArea = Template.GetArea("ProductionOrderHeader");
		
		TemplateArea.Parameters.Company = ProductionOrderHeader.Company;
		TemplateArea.Parameters.StructuralUnit = ProductionOrderHeader.StructuralUnit;
		
		If ValueIsFilled(ProductionOrderHeader.ProductionOrder) Then
			
			TemplateArea.Parameters.ProductionOrder = ProductionOrderHeader.ProductionOrder;
			
		EndIf;
		
		If ValueIsFilled(ProductionOrderHeader.SalesOrder) Then
			
			TemplateArea.Parameters.SalesOrder = ProductionOrderHeader.SalesOrder;
			
		EndIf;
		
		SpreadsheetDocument.Put(TemplateArea);
		SpreadsheetDocument.Put(EmptyLine);
		
		ProductionTaskSelection = ProductionOrderHeader.Select();
		
		While ProductionTaskSelection.Next() Do
			
			SpreadsheetDocument.StartRowAutoGrouping();
			
			// Production task line header
			
			TemplateArea = Template.GetArea("ProductionTaskLineHeader");
			
			FillPropertyValues(TemplateArea.Parameters, ProductionTaskSelection);
			TemplateArea.Parameters.TaskNumber = ObjectPrefixationClientServer.GetNumberForPrinting(ProductionTaskSelection.TaskNumber, True, True);
			TemplateArea.Parameters.TaskDate = Format(ProductionTaskSelection.TaskDate, "DLF=D");
			TemplateArea.Parameters.Output = ?(ProductionTaskSelection.Output, NStr("en = 'output'; ru = 'вывод';pl = 'wyjście';es_ES = 'salida';es_CO = 'salida';tr = 'çıktı';it = 'output';de = 'Produktionsmenge'"), NStr("en = 'no output'; ru = 'нет выработки';pl = 'brak wyjścia';es_ES = 'sin producción';es_CO = 'sin producción';tr = 'çıkış yok';it = 'nessun output';de = 'keine Produktionsmenge'"));
			
			ProductText = "";
			If ValueIsFilled(ProductionTaskSelection.FinishedVariant) Then
				ProductText = " , " + ProductionTaskSelection.FinishedVariant; 
			EndIf;
			If ValueIsFilled(ProductionTaskSelection.ProductQuantity) Then
				ProductText = ProductText + ", " + ProductionTaskSelection.ProductQuantity + " " + ProductionTaskSelection.Unit; 
			EndIf;
			TemplateArea.Parameters.ProductText = ProductText;
			
			SpreadsheetDocument.Put(TemplateArea);
			
			// Production task line section
			
			TemplateArea = Template.GetArea("ProductionTaskLineSection");
			
			BarcodesInPrintForms.AddWidthBarcodeToTableDocument(TemplateArea, ProductionTaskSelection.ProductionTask);
			FillPropertyValues(TemplateArea.Parameters, ProductionTaskSelection);
			
			TemplateArea.Parameters.PlannedWorkloadTime = ProductionTaskSelection.OperationQuantity * ProductionTaskSelection.StandardTimeInUOM;
			TemplateArea.Parameters.StartDatePlanned = Format(ProductionTaskSelection.StartDatePlanned, "DLF=DT; DE=-");
			TemplateArea.Parameters.EndDatePlanned = Format(ProductionTaskSelection.EndDatePlanned, "DLF=DT; DE=-");
			
			ComponentsList = Chars.LF;
			Components = Common.ObjectAttributeValue(ProductionTaskSelection.ProductionTask, "Inventory");
			ComponentsSelection = Components.Select();
			
			While ComponentsSelection.Next() Do
				
				ComponentsList = ComponentsList + ComponentsSelection.Products + " " + ComponentsSelection.Characteristic
				+ ", " + ComponentsSelection.Quantity + ComponentsSelection.MeasurementUnit + Chars.LF;
				
			EndDo;
			
			TemplateArea.Parameters.ComponentsList = ComponentsList;
			
			SpreadsheetDocument.Put(TemplateArea);
			
			SpreadsheetDocument.EndRowAutoGrouping();
			
			SpreadsheetDocument.Put(EmptyLine);
			
		EndDo;
		
		TemplateArea = Template.GetArea("DivideLine");
		SpreadsheetDocument.Put(TemplateArea);
		
	EndDo;
	
	TemplateArea = Template.GetArea("Footer");
	SpreadsheetDocument.Put(TemplateArea);
	
	Return SpreadsheetDocument;

EndFunction

Function PrintForm(ObjectsArray, PrintObjects, TemplateName, PrintParams = Undefined)
	
	If TemplateName = "ProductionTasksList" Then
		
		Return PrintProductionTasksList(ObjectsArray, PrintObjects, TemplateName, PrintParams)
		
	EndIf;
	
EndFunction

#EndRegion

#EndRegion

#EndIf
